Revit 2025 API
ExportUnit Enumeration
 An enumerated type listing possible target units for CAD Export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ExportUnit
Public Enumeration ExportUnit
public enum class ExportUnit
type ExportUnit
Members
Member name | Value | Description
Default | 0 |  Default export unit. Depends on Revit's current units.
Inch | 1 |  Inches in fractional notation.
Foot | 2 |  Feet and Inches in fractional notation.
Millimeter | 3 |  Millimeters as decimal values.
Centimeter | 4 |  Centimeters as decimal values.
Meter | 5 |  Meters as decimal values.
See Also
Reference
Autodesk.Revit.DB Namespace